; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	Star0 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star6 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star7)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
)
(:goal (and
	(have_image Star9 spectrograph1)
	(have_image Planet10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Star13 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
5. (take_image satellite0 star11 instrument2 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 1 of 5
6. (turn_to satellite0 planet12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet12)
   goals met: 1 of 5
7. (take_image satellite0 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 2 of 5
9. (take_image satellite0 planet10 instrument2 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite0 star13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star13)
   goals met: 3 of 5
11. (take_image satellite0 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 4 of 5
12. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 4 of 5
13. (take_image satellite0 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 5 of 5
